##Check Duplicate column

## Zheng Zeng-May 10.2025

---

### Read the file

In [1]:
import pandas as pd
df = pd.read_csv('/content/cchhl_all_flatten.csv')

<ipython-input-1-43d2729ff327>:2: DtypeWarning: Columns (1,3,10,13,14,15,19,20,33,34,35,39,40,41,42) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('/content/cchhl_all_flatten.csv')

In [4]:
df.dtypes

reference_id                                    int64
publisher                                      object
reference_title                                object
series_editor                                  object
reference_type                                 object
journal                                        object
num                                             int64
volume                                         object
year_published                                  int64
author                                         object
series_title                                   object
geo                                             int64
issue                                          object
editor                                         object
conference                                     object
place_published                                object
skip                                            int64
geo_nonus                                     float64
page_s                                         object
university                                     object
book_title                                     object
Title                                          object
Author(s)                                      object
Year                                          float64
Journal                                        object
Source                                         object
Exposure                                       object
Geographic Feature                             object
Geographic Location                            object
Health Impact                                  object
Resource Type                                  object
Special Topic                                  object
Abstract                                       object
Series                                         object
Editor                                         object
Publisher                                      object
Model/Methodology                              object
Model Timescale                                object
Climate Change and Socioeconomic Scenarios     object
Book                                           object
Volume                                         object
Page                                           object
Conference                                     object
dtype: object

### 1. publisher and Publisher

In [6]:
df['publisher'].describe()

count                            260
unique                           150
top       Cambridge University Press
freq                              20
Name: publisher, dtype: object

In [8]:
df['Publisher'].describe()

count                                                 261
unique                                                161
top       Cambridge University Press (Cambridge, England)
freq                                                   16
Name: Publisher, dtype: object

In [78]:
missing_count = df['publisher'].isna().sum()
print(f"Journal NaN number: {missing_count}")

Journal NaN number: 22435

In [77]:
missing_count = df['Publisher'].isna().sum()
print(f"Journal NaN number: {missing_count}")

Journal NaN number: 22434

In [11]:
for index, value in df['Publisher'].head(10).items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")

Index: 4, Value: Routledge (Sterling, VA)
Index: 5, Value: Routledge (Sterling, VA)
Index: 6, Value: Organization for Economic Cooperation and Development (OECD) (Paris, France)
Index: 7, Value: World Health Organization (WHO) Regional Office for Europe (Copenhagen, Denmark)
Index: 8, Value: World Health Organization (WHO) Regional Office for Europe (Copenhagen, Denmark)

In [13]:
for index, value in df['publisher'].head(10).items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")
# drop Publisher column

Index: 4, Value: Routledge
Index: 5, Value: Routledge
Index: 6, Value: Organization for Economic Cooperation and Development (OECD)
Index: 7, Value: World Health Organization (WHO) Regional Office for Europe
Index: 8, Value: World Health Organization (WHO) Regional Office for Europe

### 2. reference_title and Title

In [16]:
print(df['reference_title'][:5])
print(df['Title'][:5])

0                           Adapting to climate change
1    Vector-borne diseases: Impact of climate chang...
2    Plan for disaster before it happens: Do organi...
3                     Health impacts of climate change
4                        Climate change and adaptation
Name: reference_title, dtype: object
0                           Adapting to climate change
1    Vector-borne diseases: Impact of climate chang...
2    Plan for disaster before it happens: Do organi...
3                     Health impacts of climate change
4                        Climate change and adaptation
Name: Title, dtype: object

In [17]:
# Determine whether it is a duplicate column
# based on whether the number of words is consistent
df['refernce_title_count']=df['reference_title'].str.split().str.len()
df['title_count']=df['Title'].str.split().str.len()

# all zero means they are the same column, we can drop one of them
df['check_1']=df['refernce_title_count']-df['title_count']
df['check_1'].value_counts()
# drop Title column

check_1
0    22695
Name: count, dtype: int64

### 3. series_editor and editor

In [ ]:
for index, value in df['series_editor'].items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")

Index: 18, Value: Vakil, C.
Index: 372, Value: Vos, F.;Rodriguez, J.;Below, R.;Guha-Sapir, D.
Index: 525, Value: Kovats, S.
Index: 769, Value: Gamble, J. L.
Index: 1431, Value: May, E.
Index: 1594, Value: Meyer, L. A.;Peterson, A. C.
Index: 2251, Value: Karl, T. R.;Meehl, G. A.;Miller, C. D.;Hassol, S. J.;Waple, A. M.;Murray, W. L.
Index: 2267, Value: Walsh, M.
Index: 8469, Value: E. L. F. Schipper, J. Ayers, H. Reid, S. Huq and A. Rahman
Index: 8470, Value: C. D. Butler
Index: 8471, Value: K. E. Pinkerton and W. N. Rom
Index: 8473, Value: V. I. Grover
Index: 8474, Value: V. R. Barros, C. B. Field, D. J. Dokken, M. D. Mastrandrea, K. J. Mach, T. B. Bilir, M. Chatterjee, K. L. Ebi, Y. O. Estrada, R. C. Genova, B. Girma, E. S. Kissel, A. N. Levy, S. MacCracken, P. R. Mastrandrea and L. L. White
Index: 8475, Value: Rosenzweig, C., Solecki, W.
Index: 8478, Value: Leal Filho, W., Azeiteiro, U. M., Alves, F.
Index: 8479, Value: Akhtar, R.

In [ ]:
for index, value in df['editor'].items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")
# Comparing these two result, these two column totally different

Index: 4, Value: Leary, N.;Adejuwon, J.;Barros, V.;Burton, I.;Kulkarni, J.;Lasco, R.
Index: 5, Value: Leary, N.;Conde, C.;Kulkarni, J.;Nyong, A.;Pulhin, J.
Index: 6, Value: Agrawala, S.;Fankhauser, S.
Index: 7, Value: Matthies, F.;Bickler, G.;Marin, N. C.;Hales, S.
Index: 8, Value: Menne, B.;Apfel, F.;Kovats, S.;Racioppi, F.
Index: 11, Value: Adger, W. N.;Lorenzoni, I.;O'Brien, K. L.
Index: 12, Value: Brauch, H. G.;Behera, N. C.; ;Kameri-Mbote, P.;Grin, J.;Oswald Spring, U.; Chourou, B.; Mesjasz, C.; Krummenacher, H.
Index: 163, Value: Bates, B. C.;Kundzewicz, Z. W.;Wu, S.;Palutikof, J. P.
Index: 1072, Value: Parry, M. L.;Canziani, O. F.;Palutikof, J. P.;van der Linden, P. J.;Hanson, C. E.
Index: 1073, Value: Metz, B.;Davidson, O.;Bosch, P.;Dave, R.;Meyer, L.
Index: 1075, Value: Core Writing Team; Pachauri, R. K., Reisinger, A.
Index: 1162, Value: Karl, T. R.;Melillo, J. M.;Peterson, T. C.
Index: 1249, Value: Koundouri, P.
Index: 1992, Value: Se?guin, J.
Index: 2337, Value: United Nations Development Programme
Index: 2414, Value: Wolf, T.;Menne, B.
Index: 11216, Value: Akhtar, R; Palagiano, C

### 4. year_published and Year

In [18]:
df['check_2']=df['year_published']-df['Year']
df['check_2'].value_counts()
# These two column are the same
# drop Year column

check_2
0.0    22652
Name: count, dtype: int64

### 5. Author(s) and author

In [19]:
import numpy as np
# Change the content no author list in Author(s) column to NaN for comparing
df['Author(s)'] = df['Author(s)'].apply(lambda x: np.nan if isinstance(x, str) and x.strip() == 'No authors listed' else x)
df['Author(s)']

0                                                      NaN
1                                                      NaN
2                                                      NaN
3                                                      NaN
4                                                      NaN
                               ...
22690                                Shomar B, Rashkeev SN
22691                              Zhu D, Zhang YY, Zhu YG
22692    Sinno-Tellier S, Abadie E, Guillotin S, Bossée...
22693                                             Mündel T
22694            Abdelbaset AE, Kwak ML, Nonaka N, Nakao R
Name: Author(s), Length: 22695, dtype: object

In [20]:
df['Author_count']=df['Author(s)'].str.split().str.len()
df['author_count']=df['author'].str.split().str.len()

# all zero means they are the same column, we can drop one of them
df['check_3']=df['Author_count']-df['author_count']
df['check_3'].value_counts()

check_3
0.0    22592
1.0        3
Name: count, dtype: int64

In [ ]:
result_rows = df[df['check_3'] == 1]

# compare three rows
print(result_rows[['Author(s)', 'author']])

                                              Author(s)  \
5119  Hoang MH, Namirembe S, Van Noordwijk M, Catacu...
6162  Petrasek Macdonald J, Cunsolo Willox A, Ford J...
6176  Whitmee S, Haines A, Beyrer C, Boltz F, Capon ...

                                                 author
5119  Hoang MH, Namirembe S, Van Noordwijk M, Catacu...
6162  Petrasek Macdonald J, Cunsolo Willox A, Ford J...
6176  Whitmee S, Haines A, Beyrer C, Boltz F, Capon ...

In [24]:
print(df['Author(s)'][5119])
print(df['author'][5119])
# Author(s) has more one space in index 5119

Hoang MH, Namirembe S, Van Noordwijk M, Catacutan D, Ouml; Born I, Perez-Teran AS, Nguyen HQ, Dumas-Johansen MK
Hoang MH, Namirembe S, Van Noordwijk M, Catacutan D, Ouml;Born I, Perez-Teran AS, Nguyen HQ, Dumas-Johansen MK

In [25]:
print(df['Author(s)'][6162])
print(df['author'][6162])
# Author(s) has more one space in index 6162

Petrasek Macdonald J, Cunsolo Willox A, Ford JD, Shiwak I, Wood M, Team Imhacc; Rigolet Inuit Community Government
Petrasek Macdonald J, Cunsolo Willox A, Ford JD, Shiwak I, Wood M, Team Imhacc;Rigolet Inuit Community Government

In [26]:
print(df['Author(s)'][6176])
print(df['author'][6176])
# Author(s) has more one space in index 6176
# Drop author column

Whitmee S, Haines A, Beyrer C, Boltz F, Capon AG, Dias Bfds; Ezeh A, Frumkin H, Gong P, Head P, Horton R, Mace GM, Marten R, Myers SS, Nishtar S, Osofsky SA, Pattanayak SK, Pongsiri MJ, Romanelli C, Soucat A, Vega J, Yach D
Whitmee S, Haines A, Beyrer C, Boltz F, Capon AG, Dias Bfds;Ezeh A, Frumkin H, Gong P, Head P, Horton R, Mace GM, Marten R, Myers SS, Nishtar S, Osofsky SA, Pattanayak SK, Pongsiri MJ, Romanelli C, Soucat A, Vega J, Yach D

### 6. Series_title and Series

In [27]:
df['Series_count']=df['Series'].str.split().str.len()
df['series_title_count']=df['series_title'].str.split().str.len()

# zero means they are the same column, we can drop one of them
df['check_4']=df['Series_count']-df['series_title_count']
df['check_4'].value_counts()

check_4
0.0    43
1.0    16
Name: count, dtype: int64

In [28]:
result_rows = df[df['check_4'] == 1]
print(result_rows[['Series', 'series_title']])
# The Series column have more information than series_title

                                                 Series  \
353    Annals of the New York Academy of Sciences, 1149
689                  Annual Review of Public Health, 28
768               Synthesis and Assessment Product, 4.6
1003         Developments in Environmental Science 6, 6
1004   Annals of the New York Academy of Sciences, 1140
1152                                  Biometeorology, 1
1223             Advances in Global Change Research, 30
1564     Annual Review of Environment and Resources, 34
1640             Advances in Global Change Research, 42
1709  Advances in Experimental Medicine and Biology,...
1728             Annual Review of Resource Economics, 1
1980    Ecology and Control of Vector-Borne Diseases, 1
3851   Annals of the New York Academy of Sciences, 1244
4312   Annals of the New York Academy of Sciences, 1196
4458   Annals of the New York Academy of Sciences, 1244
4640  Current Topics in Microbiology and Immunology,...

                                       series_title
353      Annals of the New York Academy of Sciences
689                  Annual Review of Public Health
768                Synthesis and Assessment Product
1003        Developments in Environmental Science 6
1004     Annals of the New York Academy of Sciences
1152                                 Biometeorology
1223             Advances in Global Change Research
1564     Annual Review of Environment and Resources
1640             Advances in Global Change Research
1709  Advances in Experimental Medicine and Biology
1728            Annual Review of Resource Economics
1980   Ecology and Control of Vector-Borne Diseases
3851     Annals of the New York Academy of Sciences
4312     Annals of the New York Academy of Sciences
4458     Annals of the New York Academy of Sciences
4640  Current Topics in Microbiology and Immunology

In [29]:
# Rename these two column based on finding
df.rename(columns={'Series': 'Series_detailed'}, inplace=True)
# drop series_title

### 7. book_title and Book

In [30]:
df['book_title'].describe()

count                                                    62
unique                                                   47
top       Climate Change 2007: Impacts, Adaptation and V...
freq                                                     11
Name: book_title, dtype: object

In [31]:
df['Book'].describe()

count                                                    62
unique                                                   47
top       Climate Change 2007: Impacts, Adaptation and V...
freq                                                     11
Name: Book, dtype: object

In [32]:
df['Book_count']=df['Book'].str.split().str.len()
df['book_title_count']=df['book_title'].str.split().str.len()

# all zero means they are the same column, we can drop one of them
df['check_5']=df['Book_count']-df['book_title_count']
df['check_5'].value_counts()
# Drop Book Column

check_5
0.0    62
Name: count, dtype: int64

### 8. page_s and Page

In [ ]:
df['page_s'].describe()

count     19132
unique    14935
top           1
freq         46
Name: page_s, dtype: object

In [ ]:
df['Page'].describe()

count        46
unique       45
top       4-Jan
freq          2
Name: Page, dtype: object

### 9. journal and Journal

In [33]:
df['journal'].describe()

count                                                 22177
unique                                                 4219
top       International Journal of Environmental Researc...
freq                                                    941
Name: journal, dtype: object

In [34]:
df['Journal'].describe()

count                       22143
unique                      21043
top       Climate and Development
freq                           24
Name: Journal, dtype: object

In [37]:
missing_count = df['Journal'].isna().sum()
print(f"Journal NaN number: {missing_count}")

Journal NaN number: 552

In [38]:
missing_count = df['journal'].isna().sum()
print(f"journal NaN number: {missing_count}")
# The count difference comes from NaN number

journal NaN number: 518

In [35]:
for index, value in df['journal'].head(10).items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")

Index: 0, Value: The Lancet
Index: 1, Value: Parasitology Research
Index: 2, Value: Strategic Direction
Index: 3, Value: Chemical and Engineering News
Index: 9, Value: European Annals of Allergy and Clinical Immunology

In [36]:
for index, value in df['Journal'].head(10).items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")
# The Journal column have more information
# drop journal

Index: 0, Value: The Lancet. 371 (9613): 624
Index: 1, Value: Parasitology Research. 103 (Suppl 1): S1-159
Index: 2, Value: Strategic Direction. 24 (3): 8-Jun
Index: 3, Value: Chemical and Engineering News. 86 (15): 34-34
Index: 9, Value: European Annals of Allergy and Clinical Immunology. 41 (5): 160

### 10. editor and Editor

In [41]:
df['editor'].describe()

count                                                    17
unique                                                   17
top       Leary, N.;Adejuwon, J.;Barros, V.;Burton, I.;K...
freq                                                      1
Name: editor, dtype: object

In [42]:
df['Editor'].describe()

count                                                    17
unique                                                   17
top       Leary, N.; Adejuwon, J.; Barros, V.; Burton, I...
freq                                                      1
Name: Editor, dtype: object

In [45]:
df['Editor_count']=df['Editor'].str.split().str.len()
df['editor_title_count']=df['editor'].str.split().str.len()

# all zero means they are the same column, we can drop one of them
df['check_6']=df['Editor_count']-df['editor_title_count']
df['check_6'].value_counts()
# Drop Book Column

check_6
0.0    5
4.0    4
3.0    3
1.0    2
2.0    2
5.0    1
Name: count, dtype: int64

In [48]:
result_rows = df[df['check_6'] == 4]
print(result_rows[['editor', 'Editor']])
# The Series column have more information than series_title

                                                 editor  \
5     Leary, N.;Conde, C.;Kulkarni, J.;Nyong, A.;Pul...
12    Brauch, H. G.;Behera, N. C.; ;Kameri-Mbote, P....
1072  Parry, M. L.;Canziani, O. F.;Palutikof, J. P.;...
1073  Metz, B.;Davidson, O.;Bosch, P.;Dave, R.;Meyer...

                                                 Editor
5     Leary, N.; Conde, C.; Kulkarni, J.; Nyong, A.;...
12    Brauch, H. G.; Behera, N. C.; ; Kameri-Mbote, ...
1072  Parry, M. L.; Canziani, O. F.; Palutikof, J. P...
1073  Metz, B.; Davidson, O.; Bosch, P.; Dave, R.; M...

In [50]:
print(df['editor'][5])
print(df['Editor'][5])
# Editor have more sapce
# drop editor column

Leary, N.;Conde, C.;Kulkarni, J.;Nyong, A.;Pulhin, J.
Leary, N.; Conde, C.; Kulkarni, J.; Nyong, A.; Pulhin, J.

### 11. conference and Conference

In [51]:
df['conference'].describe()

count                                                    67
unique                                                   57
top       International Alliance of Research Universitie...
freq                                                      5
Name: conference, dtype: object

In [52]:
df['Conference'].describe()

count                                                    67
unique                                                   57
top       International Alliance of Research Universitie...
freq                                                      5
Name: Conference, dtype: object

In [53]:
df['Conference_count']=df['Conference'].str.split().str.len()
df['conference_count']=df['conference'].str.split().str.len()

# all zero means they are the same column, we can drop one of them
df['check_7']=df['conference_count']-df['Conference_count']
df['check_7'].value_counts()
# Drop Conference Column

check_7
0.0    67
Name: count, dtype: int64

### 12. volume and Volume

In [54]:
df['volume'].describe()

count     21518
unique      894
top          10
freq        605
Name: volume, dtype: object

In [56]:
df['Volume'].describe()

count     25
unique    13
top        6
freq       7
Name: Volume, dtype: object

In [57]:
for index, value in df['volume'].head(10).items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")

Index: 0, Value: 371
Index: 1, Value: 103
Index: 2, Value: 24
Index: 3, Value: 86
Index: 9, Value: 41

In [60]:
for index, value in df['Volume'].head(100).items():
    if isinstance(value, str) and value.strip() != '':
        print(f"Index: {index}, Value: {value}")

Index: 54, Value: 6

In [61]:
df.rename(columns={'volume': 'volume_detailed'}, inplace=True)

### Output clean duplicate csv file

In [70]:
# drop calculataion column
df = df.drop(columns=df.filter(regex=r'(?i)count$|^check').columns)

In [79]:
df.dtypes

reference_id                                    int64
publisher                                      object
reference_title                                object
series_editor                                  object
reference_type                                 object
journal                                        object
num                                             int64
volume_detailed                                object
year_published                                  int64
author                                         object
series_title                                   object
geo                                             int64
issue                                          object
editor                                         object
conference                                     object
place_published                                object
skip                                            int64
geo_nonus                                     float64
page_s                                         object
university                                     object
book_title                                     object
Title                                          object
Author(s)                                      object
Year                                          float64
Journal                                        object
Source                                         object
Exposure                                       object
Geographic Feature                             object
Geographic Location                            object
Health Impact                                  object
Resource Type                                  object
Special Topic                                  object
Abstract                                       object
Series_detailed                                object
Editor                                         object
publisher_detailed                             object
Model/Methodology                              object
Model Timescale                                object
Climate Change and Socioeconomic Scenarios     object
Book                                           object
Volume                                         object
Page                                           object
Conference                                     object
dtype: object

In [80]:
# Aftring using checking code, drop some duplicate columns
drop_columns=['publisher', 'Title', 'Year', 'author', 'series_title', 'Book', 'journal', 'editor', 'Conference']
for col in drop_columns:
  df.drop(col, axis=1, inplace=True)

In [81]:
df.to_csv('cchhl_all_flatten_cleanduplicate.csv', index=False)